In [2]:
import pandas
import numpy

df = pandas.read_csv('house.csv')
df.head(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

### Práctica 1
Haz un corte por número de línea, quedándote con las primeras 500 líneas. Llama a este DF 'corte500'

Genera 2 dataframe (llamados sample1, sample2) aleatorio a partir de corte500, con un 55% de los valores, solamente de las columnas price, bedrooms, bathrooms, sqft_living, city.

In [3]:
corte500=df.head(500)

In [4]:
sample1 = corte500.sample(frac=0.55)[['price', 'bedrooms', 'bathrooms', 'sqft_living', 'city']]
print(sample1.shape)
sample1.head(5)

(275, 5)

        price  bedrooms  bathrooms  sqft_living       city
239  750000.0       3.0       2.75         2520    Seattle
317  403000.0       3.0       2.75         2090     Duvall
391  765000.0       4.0       2.75         2790   Issaquah
394  254000.0       3.0       2.50         1850  Covington
294  440000.0       3.0       1.75         1500    Seattle

In [5]:
sample2 = corte500.sample(frac=0.55)[['price', 'bedrooms', 'bathrooms', 'sqft_living', 'city']]
sample2.shape

(275, 5)

# Aritmética y alineación de datos

Pandas simplifica las operaciones entre objetos con índices diferentes, alineando las operaciones según la etiqueta del índice. 

Si se trata de un DataFrame, alinea por nombre de columna y etiqueta de fila. 

Veamos un ejemplo:

In [6]:
s1 = pandas.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [7]:
s2 = pandas.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [8]:
# La resta se realiza coincidiendo el índice, rellenando el resto de valores con NaN
s1 - s2

a    9.4
c   -6.1
d    NaN
e    3.0
f    NaN
g    NaN
dtype: float64

### Práctica 2
Suma la columna precio de ambos samples. 

Una vez sumado, muestra los valores totales, los valores nulos, los valores no nulos. 

Series.isna() devuelve serie Booleana, con True si es nulo, False en caso contrario.

In [ ]:
suma = sample1['price'] + sample2['price']
print("Totales", suma.shape[0])
print("No nulos", suma.count())
#se usa .sum() por que devuelve una serie con todos los numeros como true o false, python interpreta esto como 1 y 0, por eso suma los true
print("Nulos", suma.isna().sum())

Totales 400
No nulos 150
Nulos 250

De la serie "suma" resultante elimina los nulos (dropan())y vuelve a mostrar.

In [12]:
suma.dropna(inplace=True)
print("Totales", suma.shape[0])
print("No nulos", suma.count())
print("Nulos", suma.isna().sum())

Totales 150
No nulos 150
Nulos 0

# Métodos aritméticos y evitar valores NaN

En operaciones aritméticas entre objetos indexados de manera diferente, es posible que desee completar los valores faltantes (nan) con un valor especial, como 0, cuando se encuentra una etiqueta de eje en un objeto pero no en el otro. 

Uusando el método del DataFrame o Serie para realizar la operación aritmética podemos indicar mediante el argumento 'fill_value' que sustituirá los valores NaN para realizar la operación aritmética.

Los métodos que comienzan por r tienen los operandos del reverso.

+ suma: add, radd 
+ resta: sub, rsub 	
+ división: div, rdiv 	
+ división entera: floordiv, rfloordiv 	
+ multiplicación: mul, rmul 	
+ exponente: pow, rpow

In [8]:
# Restamos a la Serie s1 los valores de s2 (s1 - s2)
s1.sub(s2, fill_value=0)

a    9.4
c   -6.1
d    3.4
e    3.0
f   -4.0
g   -3.1
dtype: float64

In [13]:
# Con rsub hacemos lo contrario, s2 - s1
s1.rsub(s2, fill_value=0)

a   -9.4
c    6.1
d   -3.4
e   -3.0
f    4.0
g    3.1
dtype: float64

### Práctica 3
Haz lo mismo que en práctica 2, utilizando el método suma y rellenando con 0 los valores faltantes.

In [13]:
suma = sample1['price'].add(sample2['price'], fill_value=0)
print("Totales", suma.shape[0])
print("No nulos", suma.count())
print("Nulos", suma.isna().sum())

Totales 400
No nulos 400
Nulos 0

### Práctica 4
Copia el df corte500 y crea una nueva columna en la copia que sume la columna precio con la columna precio del dataframe sample1. 

A continuación, muestra las líneas que tienen en esa nueva columna los valores a NaN.

In [14]:
corte500_copy = corte500.copy()
corte500_copy['suma'] = corte500_copy['price'] + sample1['price']
print("Tamaño corteo 500: ", corte500_copy.shape[0])
print("Tamaño corteo sample1: ", sample1.shape[0])
print(corte500_copy['suma'].isna().sum()) # Los nulos deben ser 500 - 275

Tamaño corteo 500:  500
Tamaño corteo sample1:  275
225

# ufuncs de Numpy
Las funciones de NumPy ufuncs (los métodos que se aplicaban elemento a elemento del array, como calcular el valor absoluto de cada uno (np.abs()) también funcionan en Pandas. Se puede aplicar a una SEries o a todo un DataFrame

In [15]:
df = pandas.DataFrame(numpy.random.standard_normal((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])
df.head()

               b         d         e
Utah    0.421027 -0.563428 -0.130066
Ohio    1.737005  1.201757  1.771970
Texas  -0.840431  1.429024 -0.916021
Oregon  0.276946  0.399168 -0.138237

In [16]:
# Devuelve un DataFrame con los valores modificados
numpy.abs(df)

               b         d         e
Utah    0.421027  0.563428  0.130066
Ohio    1.737005  1.201757  1.771970
Texas   0.840431  1.429024  0.916021
Oregon  0.276946  0.399168  0.138237

# Práctica 5

Aplia la raíz cuadrada a la columna precio de sample1 con una función de numpy.

In [17]:
numpy.sqrt(sample1['price'])

239    866.025404
317    634.822810
391    874.642784
394    503.984127
294    663.324958
          ...
84     696.419414
434    700.927956
464    741.552426
244    556.776436
422    761.577311
Name: price, Length: 275, dtype: float64

# Apply de Pandas
El método apply sirve para aplicar cualquier función definida por el programador a cada elemento de la Series, devolviendo una nueva Series con el resultado. 

También se puede aplicar a todo un DataFrame por filas o por columnas (devuelve un objeto Series). Por defecto se aplica la función a cada columna.

In [18]:
df.head()

               b         d         e
Utah    0.421027 -0.563428 -0.130066
Ohio    1.737005  1.201757  1.771970
Texas  -0.840431  1.429024 -0.916021
Oregon  0.276946  0.399168 -0.138237

In [19]:
# Tenemos una función que recibe una Serie y devuelve el valor máximo.
def funcion1(x):
    return x.max()

# Aplicamos la función al DataFrame (por defecto axis=0). Obteniendo el máximo de cada columna. 
df.apply(funcion1, axis='index') # Valor por defecto es index o 0 (son equivalentes). Es decir aplica la función al eje vertical (máximo de cada columna)

b    1.737005
d    1.429024
e    1.771970
dtype: float64

In [20]:
# Busca en el eje horizontal, sacando el máximo de cada fila
df.apply(funcion1, axis='columns')

Utah      1.254677
Ohio      0.956836
Texas    -0.220648
Oregon    0.088158
dtype: float64

# Práctica 6

Crea una función que se aplique a los valores de badroom de sample1 un redondeo el valor al entero más cercano

In [ ]:
def truncar(x):
    return round(x,0)

sample1['bedrooms'].apply(truncar)

# Si deseamos actualizar la columna hacemos una asignación. 
# Y si además queremos cambiar el tipo para que no salga .0 lo hacemos con astype(tipo)
# sample1['bathrooms'] = sample1['bathrooms'].apply(truncar).astype('Int16')
# sample1['bathrooms']

239    3.0
317    3.0
391    4.0
394    3.0
294    3.0
      ...
84     4.0
434    3.0
464    5.0
244    3.0
422    4.0
Name: bedrooms, Length: 275, dtype: float64

La función a aplicar con apply también puede recibir parámetros

Busca en la documentación de Pandas.

Crea una función similar a la anterior, pero que si el número de baños es mayor a 4 devuelva el entero pasado por parámetro.

In [ ]:
def truncar(x, numero):
    if x > 4:
        return numero
    else:
        return(round(x, 0))
    
salida = sample1['bathrooms'].apply(truncar, args=(8, ))
salida

109    4.0
444    3.0
210    4.0
90     5.0
467    4.0
      ...
430    4.0
335    3.0
23     4.0
423    2.0
57     5.0
Name: bedrooms, Length: 275, dtype: float64

# Ordenación por etiquetas del índice
Podemos ordenar por las etiqueas de las filas o columnas utilizando el método sort_index, que retorna un nuevo objeto ordenado. Por defecto ordena en orden ascendente. 

frame.sort_index(axis="columns", ascending=False)

Podemos ordenar por filas -> 'rows'.

In [23]:
df.sort_index(axis="columns", ascending=False)

               e         d         b
Utah   -1.343964  1.254677  0.803077
Ohio   -0.147983  0.956836  0.180582
Texas  -0.220648 -0.808841 -0.782658
Oregon -0.524030 -0.658032  0.088158

# Práctica
Ordena sample 1 por su etiqueta fila

In [ ]:
# Ordenamos en el eje vertial, inplace
sample1.sort_index(axis=0, inplace=True)
sample1

        price  bedrooms  bathrooms  sqft_living         city
499  522000.0       4.0       2.25         1800     Kirkland
498  210000.0       3.0       2.50         1040      Seattle
496  185000.0       3.0       1.50         1370       Auburn
495  950000.0       5.0       3.00         4530  Woodinville
494  647000.0       4.0       2.50         3040    Sammamish
..        ...       ...        ...          ...          ...
13   365000.0       3.0       1.00         1090      Seattle
5    490000.0       2.0       1.00          880      Seattle
3    420000.0       3.0       2.25         2000     Bellevue
2    342000.0       3.0       2.00         1930         Kent
0    313000.0       3.0       1.50         1340    Shoreline

[275 rows x 5 columns]

# Ordenación por valores

Al ordenar un DataFrame por valores de una columna, podemos especificar por cuál columna ordenar. También podemos indicar una lista de columnas. 

+ df.sort_values('columna')
+ df.sort_values(['col1', 'col2'])

# Práctica

Ordena sample1 número de habitaciones en primer lugar y después por precio.

In [ ]:
sample1.sort_values(['bedrooms', 'price'], inplace=True)
sample1

         price  bedrooms  bathrooms  sqft_living              city
477   235000.0       1.0       1.00          810           Seattle
290   100000.0       2.0       1.00          910            Algona
298   160000.0       2.0       1.00         1040              Kent
405   195000.0       2.0       1.00          720           Seattle
117   206000.0       2.0       1.00          810            Burien
..         ...       ...        ...          ...               ...
356  1750000.0       6.0       3.00         3510           Seattle
291   540000.0       7.0       5.75         3700  Lake Forest Park
122  2280000.0       7.0       8.00        13540           Redmond
252  3200000.0       7.0       4.50         6210           Seattle
241   599999.0       9.0       4.50         3830           Seattle

[275 rows x 5 columns]

# Práctica
Genera una serie con el precio medio de cada ciudad. Si necesitas bucles puedes usarlos.

In [ ]:
# precios_media=sample1.groupby('city')['price'].mean()
# precios_media

diccionario={}
for city in sample1['city'].unique():
    media_precio = sample1[sample1['city'] == city]['price'].mean()
    diccionario[city] = round(media_precio,2)
precios_media=pandas.Series(diccionario)

precios_media.head()

Seattle      589257.10
Duvall       471500.00
Issaquah     610626.77
Covington    254000.00
Kirkland     533000.00
dtype: float64


# Práctica

Genera un df a partir de sample1 con las casas más baratas que la media en función de la ciudad en la que se encuentran.

In [23]:
media_ciudad = sample1.groupby('city')['price'].transform('mean')
casas_mas_baratas = sample1[sample1['price'] < media_ciudad]
casas_mas_baratas

        price  bedrooms  bathrooms  sqft_living         city
317  403000.0       3.0       2.75         2090       Duvall
294  440000.0       3.0       1.75         1500      Seattle
151  397000.0       4.0       2.00         1440     Kirkland
426  590000.0       4.0       2.25         2430  Woodinville
486  750000.0       4.0       2.50         2980     Bellevue
..        ...       ...        ...          ...          ...
73   560000.0       3.0       2.50         1900    Sammamish
84   485000.0       4.0       3.00         2340     Kirkland
434  491300.0       3.0       1.75         1750    Sammamish
464  549900.0       5.0       2.75         3060      Seattle
244  310000.0       3.0       1.75         2070         Kent

[165 rows x 5 columns]

# MultiIndex

__set_index__ nos permite indicar qué columna serán las etiquetas de las filas (índice de filas). Pero también podemos indicar más de una columna, obteniendo indices de varios niveles.

Si seleccionamos una columna que no es única en sus valores debemos tenerlo en cuenta, ya que tendremos un índice no único como filas.

In [24]:
# Ejemplo
import pandas

data = {
    'Ciudad': ['Madrid', 'Madrid', 'Barcelona', 'Barcelona'],
    'Año': [2023, 2024, 2023, 2024],
    'Ventas': [100, 120, 90, 110],
    'Gastos': [70, 80, 60, 75]
}
df = pandas.DataFrame(data)
df.head()

      Ciudad   Año  Ventas  Gastos
0     Madrid  2023     100      70
1     Madrid  2024     120      80
2  Barcelona  2023      90      60
3  Barcelona  2024     110      75

In [26]:
# Agrupamos datos primero por Ciudad y luego por Año
df_multi = df.set_index(['Ciudad', 'Año'])
df_multi.head()

                Ventas  Gastos
Ciudad    Año
Madrid    2023     100      70
          2024     120      80
Barcelona 2023      90      60
          2024     110      75

In [28]:
# Indexación en orden de jerarquía
# Todos los datos de madrid 
df_multi.loc['Madrid']

      Ventas  Gastos
Año
2023     100      70
2024     120      80

In [29]:
# Indexación de filas concretas usando una tupla de índices
# Madrid 2023  
df_multi.loc[('Madrid', 2023)]

Ventas    100
Gastos     70
Name: (Madrid, 2023), dtype: int64

# Práctica

Carga house de nuevo en un df. Pon la columna City como índices de primer nivel y bedrooms como segundo nivel. Ordena los datos por estos índices.

In [26]:
# Idexa por las columnas indicadas y ordena
import pandas
import numpy

df_casas = pandas.read_csv('house.csv')
df_casas = df_casas.set_index(['city', 'bedrooms']).sort_index()
df_casas.head(10)

                                date     price  bathrooms  sqft_living  \
city   bedrooms
Algona 2.0       2014-05-07 00:00:00  100000.0        1.0          910
       3.0       2014-05-08 00:00:00  230000.0        1.0         1390
       3.0       2014-05-30 00:00:00  196440.0        2.0         1560
       4.0       2014-05-08 00:00:00  262000.0        2.5         2020
       4.0       2014-05-09 00:00:00  248000.0        3.0         2163
Auburn 1.0       2014-07-08 00:00:00  115000.0        2.0         1150
       2.0       2014-05-20 00:00:00  415000.0        1.0         1050
       2.0       2014-05-23 00:00:00  175000.0        1.0         1300
       2.0       2014-05-28 00:00:00  189000.0        2.0         1700
       2.0       2014-06-05 00:00:00  214100.0        2.5         1150

                 sqft_lot  floors  waterfront  view  condition  sqft_above  \
city   bedrooms
Algona 2.0          22000     1.0           0     0          3         910
       3.0          16000     1.0           0     0          4        1390
       3.0           7352     1.0           0     0          3        1560
       4.0           6236     2.0           0     0          3        2020
       4.0           5883     2.0           0     0          3        2163
Auburn 1.0           9812     1.0           0     0          4        1150
       2.0          60113     1.0           0     0          4        1050
       2.0          44431     1.0           0     0          5        1300
       2.0           3171     1.0           0     0          5         850
       2.0           2064     2.0           0     0          3        1150

                 sqft_basement  yr_built  yr_renovated                street  \
city   bedrooms
Algona 2.0                   0      1956          2001    138 Seattle Blvd S
       3.0                   0      1960          2001         322 9th Ave N
       3.0                   0      1992             0           130 Main St
       4.0                   0      2002             0       434 Pullman Ave
       4.0                   0      2006             0  429 Milwaukee Blvd S
Auburn 1.0                   0      1962             0      34215 40th Ave S
       2.0                   0      1943             0       3720 S 312th Ln
       2.0                   0      1958             0      30557 55th Ave S
       2.0                 850      1927             0           508 D St SE
       2.0                   0      2004          2003       27852 31st Pl S

                 statezip country
city   bedrooms
Algona 2.0       WA 98001     USA
       3.0       WA 98001     USA
       3.0       WA 98001     USA
       4.0       WA 98001     USA
       4.0       WA 98001     USA
Auburn 1.0       WA 98001     USA
       2.0       WA 98001     USA
       2.0       WA 98001     USA
       2.0       WA 98002     USA
       2.0       WA 98001     USA

In [27]:
# Muestra los datos de la ciudad Auburn
df_casas.loc['Auburn']

,date,price,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
bedrooms,,,,,,,,,,,,,,,,
1.0,2014-07-08 00:00:00,115000.0,2.00,1150,9812,1.0,0,0,4,1150,0,1962,0,34215 40th Ave S,WA 98001,USA
2.0,2014-05-20 00:00:00,415000.0,1.00,1050,60113,1.0,0,0,4,1050,0,1943,0,3720 S 312th Ln,WA 98001,USA
2.0,2014-05-23 00:00:00,175000.0,1.00,1300,44431,1.0,0,0,5,1300,0,1958,0,30557 55th Ave S,WA 98001,USA
2.0,2014-05-28 00:00:00,189000.0,2.00,1700,3171,1.0,0,0,5,850,850,1927,0,508 D St SE,WA 98002,USA
2.0,2014-06-05 00:00:00,214100.0,2.50,1150,2064,2.0,0,0,3,1150,0,2004,2003,27852 31st Pl S,WA 98001,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5.0,2014-06-27 00:00:00,327000.0,2.75,2400,8050,2.0,0,0,3,2400,0,1998,2006,5020 Quincy Ave SE,WA 98092,USA
5.0,2014-07-03 00:00:00,285000.0,2.50,2270,6300,2.0,0,0,3,2270,0,1995,0,12840 SE 307th Pl,WA 98092,USA
6.0,2014-05-20 00:00:00,300000.0,5.25,2860,5682,2.0,0,0,3,2860,0,1978,0,606 5th St SE,WA 98002,USA
6.0,2014-05-21 00:00:00,260000.0,2.00,2220,8797,1.0,0,0,3,2220,0,1977,2004,142 11th St SE,WA 98002,USA
7.0,2014-06-25 00:00:00,280000.0,2.50,1940,5458,2.0,0,0,3,1940,0,1994,0,12307 SE 315th Pl,WA 98092,USA

In [28]:
# Muestra los datos de Auburn con 6 habitaciones
df_casas.loc[('Auburn', 6)]

                                date     price  bathrooms  sqft_living  \
city   bedrooms
Auburn 6.0       2014-05-20 00:00:00  300000.0       5.25         2860
       6.0       2014-05-21 00:00:00  260000.0       2.00         2220

                 sqft_lot  floors  waterfront  view  condition  sqft_above  \
city   bedrooms
Auburn 6.0           5682     2.0           0     0          3        2860
       6.0           8797     1.0           0     0          3        2220

                 sqft_basement  yr_built  yr_renovated          street  \
city   bedrooms
Auburn 6.0                   0      1978             0   606 5th St SE
       6.0                   0      1977          2004  142 11th St SE

                 statezip country
city   bedrooms
Auburn 6.0       WA 98002     USA
       6.0       WA 98002     USA